In [1]:
# Librerias
import pandas as pd
import numpy as np
import datetime

In [4]:
# Paths
dataset_path = './datasets/dataset_SCL.csv'

# Lectura de archivo
df = pd.read_csv(dataset_path, sep=',')

C:\Users\jmetc\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3165: DtypeWarning: Columns (1,6) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

In [10]:
# Estudio de datos
def informacion_basica_dataset(dataset, column):
    total_values = len(dataset[column])
    null_values = len(dataset[dataset[column].isnull()])
    unique_values = len(dataset[column].unique())

    result = pd.DataFrame({
        'column': [column],
        'total_values': [total_values],
        'null_values': [null_values],
        'unique_values': [unique_values]
    }
    )

    return result

resumen_df = pd.concat([informacion_basica_dataset(df,col) for col in df.columns])
resumen_df

      column  total_values  null_values  unique_values
0    Fecha-I         68206            0          53252
0      Vlo-I         68206            0            750
0      Ori-I         68206            0              1
0      Des-I         68206            0             64
0      Emp-I         68206            0             30
0    Fecha-O         68206            0          62774
0      Vlo-O         68206            1            867
0      Ori-O         68206            0              1
0      Des-O         68206            0             63
0      Emp-O         68206            0             32
0        DIA         68206            0             31
0        MES         68206            0             12
0        Aﾃ前         68206            0              2
0     DIANOM         68206            0              7
0  TIPOVUELO         68206            0              2
0      OPERA         68206            0             23
0   SIGLAORI         68206            0              1
0   SIGLADES         68206            0             62

In [9]:
# Tipo de columna
df.dtypes

Fecha-I      object
Vlo-I        object
Ori-I        object
Des-I        object
Emp-I        object
Fecha-O      object
Vlo-O        object
Ori-O        object
Des-O        object
Emp-O        object
DIA           int64
MES           int64
Aﾃ前           int64
DIANOM       object
TIPOVUELO    object
OPERA        object
SIGLAORI     object
SIGLADES     object
dtype: object

In [11]:
# Extracto del dataset
df.head(5)

,Fecha-I,Vlo-I,Ori-I,Des-I,Emp-I,Fecha-O,Vlo-O,Ori-O,Des-O,Emp-O,DIA,MES,Aﾃ前,DIANOM,TIPOVUELO,OPERA,SIGLAORI,SIGLADES
0,2017-01-01 23:30:00,226,SCEL,KMIA,AAL,2017-01-01 23:33:00,226,SCEL,KMIA,AAL,1,1,2017,Domingo,I,American Airlines,Santiago,Miami
1,2017-01-02 23:30:00,226,SCEL,KMIA,AAL,2017-01-02 23:39:00,226,SCEL,KMIA,AAL,2,1,2017,Lunes,I,American Airlines,Santiago,Miami
2,2017-01-03 23:30:00,226,SCEL,KMIA,AAL,2017-01-03 23:39:00,226,SCEL,KMIA,AAL,3,1,2017,Martes,I,American Airlines,Santiago,Miami
3,2017-01-04 23:30:00,226,SCEL,KMIA,AAL,2017-01-04 23:33:00,226,SCEL,KMIA,AAL,4,1,2017,Miercoles,I,American Airlines,Santiago,Miami
4,2017-01-05 23:30:00,226,SCEL,KMIA,AAL,2017-01-05 23:28:00,226,SCEL,KMIA,AAL,5,1,2017,Jueves,I,American Airlines,Santiago,Miami